<template>
  <div class="wrapper">
  <my-button fontSize="20px" backgButton="#B7AEF2" @click="$router.go(-1)">Назад</my-button>
    <h1>
      Специальная теория
    </h1>
    <div v-for="theory in theorys">
      <div v-if="theory.bonus">


      </div>
    </div>
    <theory-card topic="Стандартные кодировки текста" content="<p>Кодовая страница (англ. code page) — таблица, сопоставляющая каждому значению байта некоторый символ (или его отсутствие). Обычно код символа имеет размер 8 бит, так что кодовая страница может содержать максимум 256 символов, из чего вытекает резкая недостаточность всякой 8-битной кодовой страницы для представления многоязычных текстов. К тому же часть символов используется как управляющие, из-за чего число печатных символов редко превышает 223.</p>

<p>В интерфейсе современных версий операционной системы Microsoft Windows имеется два способа представления текста: </p>
<ul>
 <li>в форме традиционных 8-битных кодовых страниц </li>
<li> в виде UTF-16.</li></ul>
<p>В любом случае все символы кодируются  одинаковым числом бит.</p>

<p>В других операционных системах может использоваться неравномерный код UTF-8.</p>

<p>Таблица ASCII</p>
<p>ASCII (англ. American Standard Code for Information Interchange) — американский стандартный код для обмена информацией.</p>

<p>ASCII представляет собой кодировку для представления десятичных цифр, латинского и национального алфавитов, знаков препинания и управляющих символов. Изначально разработанная как 7-битная, с широким распространением 8-битного байта ASCII стала восприниматься как половина 8-битной. В компьютерах обычно используют расширения ASCII с задействованной второй половиной байта.</p>

<p>Вариант ASCII без национальных символов называется US-ASCII, или «International Reference Version».</p>

<p>Таблицу соответствия кодов и символов можно посмотреть на официальном сайте.</p>

<p>Для кодирования текстов на русском языке (т.е. букв кириллицы) наиболее широко применяются следующие кодовые страницы:</p>
<ul>
<li> Windows-1251, она же Microsoft code page 1251 (CP1251) — в системах Windows;</li>
 <li>Семейство кодовых страниц KOI-8;</li>
 <li>Альтернативная кодировка, она же IBM code page 866 — в системах DOS, а также в текстовых окнах Microsoft Windows;</li>
<li> MacCyrillic — на компьютерах Macintosh.</li></ul>
<p>Использование различных кодовых страниц создаёт много неудобств, как для пользователей, так и для программистов. При попытке прочесть текстовый файл при помощи кодовой страницы, несовместимой с той, в которой он был создан, возникают крокозябры. В последние годы получил широкое распространение Unicode как альтернатива традиционным кодовым страницам.</p>

<p>Unicode</p>
<p>Юникод (англ. Unicode) — стандарт кодирования символов, позволяющий представить знаки практически всех письменных языков. Стандарт предложен в 1991 году некоммерческой организацией «Консорциум Юникода» (англ. Unicode Consortium, Unicode Inc.). Применение этого стандарта позволяет закодировать очень большое число символов из разных письменностей: в документах Unicode могут соседствовать китайские иероглифы, математические символы, буквы греческого алфавита, латиницы и кириллицы, при этом становится ненужным переключение кодовых страниц. </p>

<p>UTF-16 (англ. Unicode Transformation Format) в информатике — один из способов кодирования символов из Unicode в виде последовательности 16-битных слов. В кодировке UTF-16 под любой символ уходит ровно 2 байта.</p>

<p>Есть кодировки и с переменным количеством бит на символ, например, кодировка UTF-8.</p>"/>    <h1>
      Базовая теория
    </h1>
    <div v-for="theory in theorys">
      <div v-if="!theory.bonus">
        <theory-card :topic="theory.topic" :content="theory.content"/>
      </div>
    </div>
  </div>
</template>

<script>
import TheoryCard from "../components/UI/TheoryCard.vue";
import MyButton from "../components/UI/Button.vue";
import {mapActions, mapState} from "vuex";

export default {
  name: "TheoryView",
  components: {TheoryCard, MyButton},
  methods: {
    ...mapActions({
      getTheory: "getTheory",
    }),
  },
  async mounted() {
    this.$store.dispatch('getTheory');
  },
  computed: {
    ...mapState({
      theorys: state => state.get.theorys,
    }),
  },
}
</script>

<style scoped>
  .wrapper{
    display: flex;
    flex-direction: column;
    align-items: center;
    margin: 24px 0 0 0;
  }

  h1{
    margin: 8px;
  }
</style>